In [2]:
import numpy as np
import pandas as pd

In [12]:
data = np.random.randn(4,3) * 10

In [13]:
data

array([[ -1.50792691,  16.48590201,  -6.93054888],
       [  2.73087298,  -2.97027999,   1.30003838],
       [  4.97984428,   1.93393333,   5.46465098],
       [-10.74939054,   8.52470127,   7.2841071 ]])

## DATA FRAMES

In [14]:
data_frame = pd.DataFrame(data)

In [15]:
data_frame

           0          1         2
0  -1.507927  16.485902 -6.930549
1   2.730873  -2.970280  1.300038
2   4.979844   1.933933  5.464651
3 -10.749391   8.524701  7.284107

In [16]:
data_frame[0]

0    -1.507927
1     2.730873
2     4.979844
3   -10.749391
Name: 0, dtype: float64

In [17]:
type(data_frame[0])

pandas.core.series.Series

In [20]:
detail_data_frame = pd.DataFrame(data,index=["Osman","Kagan","Ahmet","Hamdi"],columns=["Maas","Yas","Deneyim"])

In [21]:
detail_data_frame

            Maas        Yas   Deneyim
Osman  -1.507927  16.485902 -6.930549
Kagan   2.730873  -2.970280  1.300038
Ahmet   4.979844   1.933933  5.464651
Hamdi -10.749391   8.524701  7.284107

In [22]:
detail_data_frame["Maas"]

Osman    -1.507927
Kagan     2.730873
Ahmet     4.979844
Hamdi   -10.749391
Name: Maas, dtype: float64

In [29]:
detail_data_frame["Deneyim"]

Osman   -6.930549
Kagan    1.300038
Ahmet    5.464651
Hamdi    7.284107
Name: Deneyim, dtype: float64

In [30]:
detail_data_frame[["Deneyim"]]

        Deneyim
Osman -6.930549
Kagan  1.300038
Ahmet  5.464651
Hamdi  7.284107

In [31]:
detail_data_frame[["Maas","Yas"]]

            Maas        Yas
Osman  -1.507927  16.485902
Kagan   2.730873  -2.970280
Ahmet   4.979844   1.933933
Hamdi -10.749391   8.524701

In [33]:
detail_data_frame.loc["Osman"]

Maas       -1.507927
Yas        16.485902
Deneyim    -6.930549
Name: Osman, dtype: float64

In [34]:
detail_data_frame.loc[["Osman"]]

           Maas        Yas   Deneyim
Osman -1.507927  16.485902 -6.930549

In [36]:
detail_data_frame.iloc[0]

Maas       -1.507927
Yas        16.485902
Deneyim    -6.930549
Name: Osman, dtype: float64

In [37]:
detail_data_frame.iloc[[0]]

           Maas        Yas   Deneyim
Osman -1.507927  16.485902 -6.930549

## DATA FRAME OPERATIONS

In [40]:
detail_data_frame["Ikramiye"] = detail_data_frame["Maas"] * 2

In [41]:
detail_data_frame

            Maas        Yas   Deneyim   Ikramiye
Osman  -1.507927  16.485902 -6.930549  -3.015854
Kagan   2.730873  -2.970280  1.300038   5.461746
Ahmet   4.979844   1.933933  5.464651   9.959689
Hamdi -10.749391   8.524701  7.284107 -21.498781

In [42]:
detail_data_frame.drop("Ikramiye",axis=1)

            Maas        Yas   Deneyim
Osman  -1.507927  16.485902 -6.930549
Kagan   2.730873  -2.970280  1.300038
Ahmet   4.979844   1.933933  5.464651
Hamdi -10.749391   8.524701  7.284107

In [43]:
detail_data_frame.drop("Kagan",axis=0)

            Maas        Yas   Deneyim   Ikramiye
Osman  -1.507927  16.485902 -6.930549  -3.015854
Ahmet   4.979844   1.933933  5.464651   9.959689
Hamdi -10.749391   8.524701  7.284107 -21.498781

In [44]:
detail_data_frame

            Maas        Yas   Deneyim   Ikramiye
Osman  -1.507927  16.485902 -6.930549  -3.015854
Kagan   2.730873  -2.970280  1.300038   5.461746
Ahmet   4.979844   1.933933  5.464651   9.959689
Hamdi -10.749391   8.524701  7.284107 -21.498781

In [45]:
detail_data_frame.drop("Ikramiye",axis=1,inplace=True)

In [46]:
detail_data_frame

            Maas        Yas   Deneyim
Osman  -1.507927  16.485902 -6.930549
Kagan   2.730873  -2.970280  1.300038
Ahmet   4.979844   1.933933  5.464651
Hamdi -10.749391   8.524701  7.284107

In [48]:
detail_data_frame.loc["Osman"]

Maas       -1.507927
Yas        16.485902
Deneyim    -6.930549
Name: Osman, dtype: float64

In [49]:
detail_data_frame.loc["Osman"]["Maas"]

-1.5079269066626908

In [50]:
detail_data_frame.loc["Osman","Maas"]

-1.5079269066626908

In [52]:
boolean_detail_data_frame = detail_data_frame < 0

In [53]:
boolean_detail_data_frame

        Maas    Yas  Deneyim
Osman   True  False     True
Kagan  False   True    False
Ahmet  False  False    False
Hamdi   True  False    False

In [54]:
detail_data_frame

            Maas        Yas   Deneyim
Osman  -1.507927  16.485902 -6.930549
Kagan   2.730873  -2.970280  1.300038
Ahmet   4.979844   1.933933  5.464651
Hamdi -10.749391   8.524701  7.284107

In [55]:
detail_data_frame[boolean_detail_data_frame]

            Maas      Yas   Deneyim
Osman  -1.507927      NaN -6.930549
Kagan        NaN -2.97028       NaN
Ahmet        NaN      NaN       NaN
Hamdi -10.749391      NaN       NaN

In [56]:
detail_data_frame[detail_data_frame < 0]

            Maas      Yas   Deneyim
Osman  -1.507927      NaN -6.930549
Kagan        NaN -2.97028       NaN
Ahmet        NaN      NaN       NaN
Hamdi -10.749391      NaN       NaN

In [57]:
detail_data_frame[detail_data_frame["Yas"] > 0]

            Maas        Yas   Deneyim
Osman  -1.507927  16.485902 -6.930549
Ahmet   4.979844   1.933933  5.464651
Hamdi -10.749391   8.524701  7.284107

## CHANGE INDEX

In [58]:
detail_data_frame.reset_index()

   index       Maas        Yas   Deneyim
0  Osman  -1.507927  16.485902 -6.930549
1  Kagan   2.730873  -2.970280  1.300038
2  Ahmet   4.979844   1.933933  5.464651
3  Hamdi -10.749391   8.524701  7.284107

In [60]:
new_index_list = ["osm", "kag", "ahm", "ham"]

In [61]:
detail_data_frame["Yeni Index"] = new_index_list

In [66]:
detail_data_frame

            Maas        Yas   Deneyim Yeni Index
Osman  -1.507927  16.485902 -6.930549        osm
Kagan   2.730873  -2.970280  1.300038        kag
Ahmet   4.979844   1.933933  5.464651        ahm
Hamdi -10.749391   8.524701  7.284107        ham

In [69]:
detail_data_frame.set_index("Yeni Index",inplace=True)

In [70]:
detail_data_frame

                 Maas        Yas   Deneyim
Yeni Index
osm         -1.507927  16.485902 -6.930549
kag          2.730873  -2.970280  1.300038
ahm          4.979844   1.933933  5.464651
ham        -10.749391   8.524701  7.284107

In [73]:
detail_data_frame.loc["osm"]

Maas       -1.507927
Yas        16.485902
Deneyim    -6.930549
Name: osm, dtype: float64

## MULTI INDEXES

In [75]:
first_indexes = ["Friends", "Friends", "Friends", "Friends", "Friends", "Friends", "HIMYM?", "HIMYM?", "HIMYM?", "HIMYM?", "HIMYM?"]

In [76]:
second_indexes = ["Ross", "Rachel", "Phoebe", "Monica", "Chandler", "Joey", "Ted", "Barney", "Robin", "Lily", "Marshall"]

In [77]:
zipped_indexes = list(zip(first_indexes, second_indexes))

In [78]:
zipped_indexes

[('Friends', 'Ross'),
 ('Friends', 'Rachel'),
 ('Friends', 'Phoebe'),
 ('Friends', 'Monica'),
 ('Friends', 'Chandler'),
 ('Friends', 'Joey'),
 ('HIMYM?', 'Ted'),
 ('HIMYM?', 'Barney'),
 ('HIMYM?', 'Robin'),
 ('HIMYM?', 'Lily'),
 ('HIMYM?', 'Marshall')]

In [80]:
zipped_indexes = pd.MultiIndex.from_tuples(zipped_indexes)

In [83]:
type(zipped_indexes)

pandas.core.indexes.multi.MultiIndex

In [84]:
zipped_indexes

MultiIndex([('Friends',     'Ross'),
            ('Friends',   'Rachel'),
            ('Friends',   'Phoebe'),
            ('Friends',   'Monica'),
            ('Friends', 'Chandler'),
            ('Friends',     'Joey'),
            ( 'HIMYM?',      'Ted'),
            ( 'HIMYM?',   'Barney'),
            ( 'HIMYM?',    'Robin'),
            ( 'HIMYM?',     'Lily'),
            ( 'HIMYM?', 'Marshall')],
           )

In [90]:
my_series_list = [[31, "A"],[29, "B"],[32, "C"],[34, "D"],[28, "E"],[30, "F"],[26, "G"],[27, "H"],[29, "J"],[32, "K"],[30, "L" ]]

In [91]:
my_series_list

[[31, 'A'],
 [29, 'B'],
 [32, 'C'],
 [34, 'D'],
 [28, 'E'],
 [30, 'F'],
 [26, 'G'],
 [27, 'H'],
 [29, 'J'],
 [32, 'K'],
 [30, 'L']]

In [92]:
my_series_numpy_list = np.array(my_series_list)

In [93]:
my_series_numpy_list

array([['31', 'A'],
       ['29', 'B'],
       ['32', 'C'],
       ['34', 'D'],
       ['28', 'E'],
       ['30', 'F'],
       ['26', 'G'],
       ['27', 'H'],
       ['29', 'J'],
       ['32', 'K'],
       ['30', 'L']], dtype='<U21')

In [98]:
my_series_data_frame = pd.DataFrame(my_series_numpy_list, index=zipped_indexes, columns=["Yas", "Meslek"])

In [99]:
my_series_data_frame

                 Yas Meslek
Friends Ross      31      A
        Rachel    29      B
        Phoebe    32      C
        Monica    34      D
        Chandler  28      E
        Joey      30      F
HIMYM?  Ted       26      G
        Barney    27      H
        Robin     29      J
        Lily      32      K
        Marshall  30      L

In [101]:
my_series_data_frame.loc["Friends"]

         Yas Meslek
Ross      31      A
Rachel    29      B
Phoebe    32      C
Monica    34      D
Chandler  28      E
Joey      30      F

In [102]:
my_series_data_frame.loc["HIMYM?"]

         Yas Meslek
Ted       26      G
Barney    27      H
Robin     29      J
Lily      32      K
Marshall  30      L

In [103]:
my_series_data_frame.loc["HIMYM?"].loc["Ted"]

Yas       26
Meslek     G
Name: Ted, dtype: object

In [104]:
my_series_data_frame.index.names = ["Dizi Ad", "Karakter Ad"]

In [105]:
my_series_data_frame

                      Yas Meslek
Dizi Ad Karakter Ad
Friends  Ross          31      A
         Rachel        29      B
         Phoebe        32      C
         Monica        34      D
         Chandler      28      E
         Joey          30      F
HIMYM?   Ted           26      G
         Barney        27      H
         Robin         29      J
         Lily          32      K
         Marshall      30      L